Repository: wp-plugins/endomondowp
Catalog: languages/odynogooglegroups-*.po
Languages: it_it

source: A widget that displays the last google groups message
it_it: Widget che mostra gli ultimi messaggi presenti su Google Groups

source: Title:
it_it: Titolo:

source: Google Group Name:
it_it: Nome del gruppo su Google :

source: Number of message:
it_it: Numero di messaggi:

source: TestLanguage
it_it: LANGUAGE ITA

source: Information
it_it: Informazioni

source: Plugin Homepage
it_it: Sito del plugin

source: Suggest a Feature
it_it: Suggerimenti

source: Report a Bug
it_it: Segnala un errore

source: Rate the plugin on WordPress.org
it_it: Valuta questo plugin su WordPress.org

source: You can add the group forum on your page with this shortcode, just swap "name-of-group" with your group name <code>[google_groups name="name-of-groups"]</code> and if you have your groups on private domain you can add the attribute "domain" to resolve your custom instance, for example: <code>[google_groups name="..." domain="staniscia.net"]</code> If you want to control the view, you can add these attributes on shortcode
it_it: Tramite questo plugin tu puoi aggiungere il tuo gruppo google grazie al seguente shortcode <code>[google_groups name="name-of-groups"]</code> naturalmente basta sostituire "name-of-group" con il nome del tuo gruppo. Se il tuo gruppo è nascosto oppure è impostato su un "private domian" allora bisognerà aggiungere l'attributo "domain", per esempio<code>[google_groups name="..." domain="staniscia.net"]</code>. Altri attributi sono presnti e possono essere utilizzati per controllare la visualizzazione, ecco la lista completa:

source: Options
it_it: Opzioni

source: Description
it_it: Descrizione

source: unique id of groups (default is random number)
it_it: id univoco del gruppo ( default è un numero causale autogenerato)

source: name of groups (default is random number)
it_it: nome del gruppo

source: the width of page (default is 100%)
it_it: larghezza dello spazio occupato dal plugin ( default 100% )

source: the height of page (default is 800px)
it_it: indica l'altezza in pixle occupato dal plugin ( default 800px)

source: the name of domain of groups (default none)
it_it: Il nome del dominio dove è collocato il gruppo ( default niente )

source: whether to show an embedded search box on destination forum pages. (default is false)
it_it: vine visualizzata una casella di ricerca (default è false)

source: if you want to show the forum title and description, false if you don't want to show the title or description (default is true)
it_it: se vuoi aggiungere il titolo del forum e la descrizione, false se non vuoi mostrare ne titolo ne descrizione (default true)

source: if you want to hide the subject of the last post in My Forums view, false if you want to leave the subject visible (default is true)
it_it: se vuoi nascondere il soggetto del post, false se vuoi mostrare il soggetto (default true)

source: whether to show tabs for changing views (e.g., to the Members view), on destination forum pages (default is false)
it_it: se visualizzare le schede per cambiare vista (ese: vista menbri) nelle pagine di destinazione del forum (di default è false)

source: For designers...
it_it: Per i designers...

source: If you want customize the style of view, you can add css and use the following hook
it_it: Se si desidera personalizzare lo stile di visualizzazione, oppure aggiungere css, utilizzando i seguenti hook:

source: The short code
it_it: Short code

source: For developer...
it_it: Per gli sviluppatori

source: You can use the Odyno Google Groups on your plugin! Otherwise you can use it on your current theme. In according to Codex, you can modify the current theme with <a href="http://codex.wordpress.org/Child_Themes" target="new">Child Themes « WordPress Codex</a>, with a new <a href="http://codex.wordpress.org/Page_Templates" target="new">Page Templates « WordPress Codex </a> or simply modify directly the php file of theme. In any of this case you can add a invocation of function <code>do_odyno_google_groups()</code> and you will have same action of shortcode. Also the parameters of function are the same of shortcode and are shown below
it_it: Tu puoi usare Odyno google groups all'interno del tuo plugin! Oppure all'interno del tema corrente. I riferimento a quanto scritto su Codex, puoi farlo con i <a href="http://codex.wordpress.org/Child_Themes" target="new">Child Themes « WordPress Codex</a>, con un <a href="http://codex.wordpress.org/Page_Templates" target="new">Page Templates « WordPress Codex </a> oppure direttamente nel file php del tema (ma questo è altamente sconsigliato ;). In tutti questi casi puoi invocare la funzione <code>do_odyno_google_groups()</code> per ottenere lo stesso identico risultato dello shortcode! Anche i paramentri di questa funzione sono identici allo shortcode e sono mostrati qui di seguito:

source: Example:
it_it: Esempio:

source: Otherwise on your plugin or on your <a href="http://codex.wordpress.org/Functions_File_Explained" target="new">function.php</a> you can add one hook to one of 4 action ( see <a href="http://codex.wordpress.org/Glossary#Action" target="new">Actions</a> ) and you can run your custom code. The allowed action are show below and all action have the same parameter of do_odyno_google_groups function:
it_it: E' possibile inserire tue personalizzazioni sia nel tuo plugin (oppure nel tuo <a href="http://codex.wordpress.org/Functions_File_Explained" target="new">function.php</a>) tramite 4 differenti azioni ( se non sai di cosa sto parlando guarda le <a href="http://codex.wordpress.org/Glossary#Action" target="new">Actions su Codex</a> ).Tutte le azioni hanno gli stessi parametri della funzione <code>do_odyno_google_groups()</code> e sono:

source: It's called before do_odyno_google_groups() function
it_it: Viene invocato prima che venga chiamata la funzione do_odyno_google_groups()

source: It's called after do_odyno_google_groups() function
it_it: Viene invocato dopo che è stata chiamata la funzione do_odyno_google_groups()

source: It's called before invocation of all shortcode [google_groups]
it_it: Viene invocato prima dello shortcode [google_groups]

source: It's called after invocation of all shortcode [google_groups]
it_it: E' incovato dopo l'invocazione dello shortcode [google_groups]

source: Save options
it_it: Salva le opzioni

source: You do not have sufficient permissions to access this page.
it_it: Attenzione: non hai i permessi suffigienti per accedere a questa parte del sito.

source: Show a little and invisible sign of this plugin ( Thanks! )
it_it: Mostra un piccola e invisibile firma ( Grazie! )

source: Enable the tracking of this WordPress installation with anonymous data.
it_it: Abilita il monitoraggio di questa installazione ( solo dati anonimi! )
